OpenFOAM-v2112/tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# Setup case
./Allrun.pre

#-- Run in parallel

# Decompose
runApplication decomposePar -allRegions -constant

# Set the initial fields
restore0Dir

runParallel $(getApplication)

# Reconstruct
runApplication reconstructPar -allRegions

echo
echo "Use paraFoam -touch-all to create files for paraview post-processing"
echo

#------------------------------------------------------------------------------
